//
//  main.swift
//  project 1
//
//  Created by Рауль on 9/12/22.
//

import Foundation

// Составить программу, которая будет добавлять товары в базу данных товаров магазина. Учесть, что у некоторых товаров может не быть некоторых параметров

//Параметры:
//Название
//Производитель
//Вес
//Штрих-код
//Цена
//Скидка (если есть - указываете, если нет - nil)
//Наличие (если есть - указываете, если нет - nil)
//В конце вывести общее количество товаров (какого вида сколько товаров) и общую стоимость товаров магазина
//

var shop = ["Shop"]
var cost = [Int]()
var pro = ["kyrg"]
var massa = [Float]()
var barcode = [String]()
var skidka = 0
var finalCost = 0
for(index, item) in shop.enumerated() {
    if index == 0 {
        shop.append("Хлеб")
        pro.append("Кыргызстан")
        massa.append(0.20)
        cost.append(20)
        barcode.append("XXX0012XXX")
        print("\(shop[1]): производитель - \(pro[1]), масса хлеба - \(massa[0])гр, цена - \(cost[0])сом, штрих-код товара - \(barcode[0])")
        }
    if index == 0 {
        shop.append("Нитро")
        pro.append("Кыргызстан")
        massa.append(0.500)
        cost.append(65)
        barcode.append("XXX013XXX")
        print ("\(shop[2]): производитель - \(pro[1]), масса нитро \(massa[1])гр, цена - \(cost[1])сом, штрих-код товара - \(barcode[1])")
    }
    if index == 0 {
        shop.append("Чипсы")
        pro.append("Кыргызстан")
        cost.append(110)
        massa.append(0.100)
        barcode.append("XXX014XXX")
        print ("\(shop[3]): производитель - \(pro[1]), масса чипс \(massa[2])гр, цена - \(cost[2])сом, штрих-код товара - \(barcode[2])")
    }
    if index == 0 {
        shop.append("Молоко")
        pro.append("Кыргызстан")
        massa.append(1)
        cost.append(80)
        barcode.append("XXX015XXX")
        print ("\(shop[4]): производитель - \(pro[1]), масса молока \(massa[3])л, цена - \(cost[3])сом, штрих-код товара - \(barcode[3])")
    }
    if index == 0 {
        print ("\(shop[4]): производитель - \(pro[1]), масса молока \(massa[3])л, цена - \(cost[3])сом, штрих-код товара - \(barcode[3])")
        var finalcost = (cost[0] + cost[1] + cost[2] + cost[3]) / 100 * 5
        var totalcost = (cost[0] + cost[1] + cost[2] + cost[3] - finalcost)
        print("\(cost[0] + cost[1] + cost[2] + cost[3]), со скидкой - \(finalcost), общая цена - \(totalcost)")
        print("\(shop.count) - видов в магазине")
    }

    }

/* //Воин, Колдун, Медик, Защитник
 //У каждого по 1000 ХП изначально (у защитника 1500)
 //Каждый раунд наносят удар по 200, 300, 0, 100
 //Медик лечит один раз в 2 раунда всю команду на 200 ХП кроме себя самого
 //Медик наносить удар не может
 //Мёртвых игроков лечить нельзя и они не наносят урон

 //Босс
 //5000 ХП изначально
 //Наносит по 200 ХП урона каждому игроку в течение игры пока не умрет
 //Игра заканчивается когда умирает БОСС и жив хотябы один игрок, либо когда все игроки мертвы, а босс жив
 //В конце выводится print - сколько раундов прошло, сколько урона нанес каждый игрок и кто всё-таки стал победителем

 //1 раунд
 //Герои атакуют
 //(герой) нанес (урон) урона БОССУ. ХП героя - (ХП)
 //(герой) нанес (урон) урона БОССУ. ХП героя - (ХП)
 //(герой) нанес (урон) урона БОССУ. ХП героя - (ХП)
 //Босс Атакует
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП)

 //Игроки победили, БОСС мертв
 //9 раундов прошло
 //Если ХП - 0 (т.е герой умер - делаете принт (Герой) мертв)
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП)
 //ХП героя (героя) - (ХП) */


let heroes = [ "воин", "маг", "медик", "защитник", "босс"]
var hp = [1000,1000,1000,1500]
var attack = [ 200, 300, 0, 100,200]
var hpBoss = 5000
var round = 0
print("Герои атакуют")
print("1-ый раунд")
for (index,item) in hp.enumerated() {

    if index == 0 {
        print("\(heroes[0]) - наносит урон \(attack[0]) - \(hp[0] - attack[4]) хп героя")
    }
    if index == 1 {
        print(" \(heroes[1]) - наносит урон \(attack[1]) - \(hp[1] - attack[4]) хп героя")
    }
    if index == 2 {
        print(" \(heroes[2]) - наносит урон \(attack[2]) - \(hp[2] - attack[4]) хп героя")
    }
    if index == 3 {
        print(" \(heroes[3]) - наносит урон \(attack[3]) - \(hp[3] - attack[4]) хп героя")

        while hpBoss > 0 {
            round += 1
            hpBoss -= (attack[0] + attack[1] + attack[2] + attack [3])

            if round % 2 == 0{
                hp[0] = hp[0] + 200
                hp[1] = hp[1] + 200
                hp[2] = hp[2] + 200
                hp[3] = hp[3] + 200

            }
            if hpBoss > 0 {
                hp[0] = hp[0] - 200
                hp[1] = hp[1] - 200
                hp[2] = hp[2] - 200
                hp[3] = hp[3] - 200

            }

            if hpBoss <= 0 && hp.reduce(0,+) > 0 {
                print("Выиграли люди за \(round) раундов \n")
                print("\(heroes[0]) нанес \(round * attack[0]) урона \n")
                print("\(heroes[1]) нанес \(round * attack[1]) урона \n")
                print("\(heroes[2]) нанес \(round * attack[2]) урона \n")
                print("\(heroes[3]) нанес \(round * attack[3]) урона \n")
                print("\(heroes[4]) нанес \(round * attack[4]) урона  каждому, но маг вылечил всех на \(round / 2 * 200) хп")
            }
            if hpBoss <= 0 && hp.reduce(0,+) <= 0 {
                print("все умерли за \(round) раундов")
            }
            if hpBoss > 0 && hp.reduce(0,+) <= 0 {
                print("выйграл босс за \(round) раундов")
            }
        }
    }
}

